In [13]:
import pandas as pd
import sqlite3

dbpath = "test.db"
con = sqlite3.connect(dbpath)
con.execute("PRAGMA foreign_keys = ON;")

In [ ]:

cur = con.cursor()
cur.executescript("""
DROP TABLE IF EXISTS assignments;
DROP TABLE IF EXISTS projects;
DROP TABLE IF EXISTS departments;
DROP TABLE IF EXISTS employees;

CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    salary INTEGER NOT NULL
);  
                  
CREATE TABLE IF NOT EXISTS departments (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    employee_id INTEGER,
    FOREIGN KEY (employee_id) REFERENCES employees(id)
);
                  
CREATE TABLE IF NOT EXISTS projects (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department_id INTEGER,
    FOREIGN KEY (department_id) REFERENCES departments(id)
);
                
CREATE TABLE IF NOT EXISTS assignments (
    employee_id INTEGER,
    project_id INTEGER,
    PRIMARY KEY (employee_id, project_id),
    FOREIGN KEY (employee_id) REFERENCES employees(id),
    FOREIGN KEY (project_id) REFERENCES projects(id)
);

INSERT INTO employees (id, name, salary) VALUES
    (1, 'Alice', 70000),
    (2, 'Bob', 80000),
    (3, 'Charlie', 90000);  
INSERT INTO departments (id, name, employee_id) VALUES
    (1, 'HR', 1),
    (2, 'Engineering', 2),
    (3, 'Marketing', 3);
INSERT INTO projects (id, name, department_id) VALUES
    (1, 'Project A', 2),
    (2, 'Project B', 3);
INSERT INTO assignments (employee_id, project_id) VALUES
    (2, 1),
    (3, 2);
""")
con.commit()

In [ ]:
tables = cur.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
for table in tables:
    print(table[0])

df = pd.read_sql_query("SELECT * FROM employees;", con)
df_dept = pd.read_sql_query("SELECT * FROM departments;", con)
df_assign = pd.read_sql_query("SELECT * FROM assignments;", con)
df_projects = pd.read_sql_query("SELECT * FROM projects;", con)

res = pd.read_sql_query("SELECT * FROM employees ")

df_dept

employees
departments
projects
assignments

   id         name  employee_id
0   1           HR            1
1   2  Engineering            2
2   3    Marketing            3